In [2]:
import pandas as pd
import numpy as np

In [36]:
df = { 'w' : [0,1,2,3,4],
    'x': [68,75,86,80,66],
    'y': [78,85,96,80,86],
    'z': [84,94,89,83,86],
    '' : [86,97,96,72,83]
}

In [44]:
data = pd.DataFrame(df) # original dataframe
data

   w   x   y   z
0  0  68  78  84  86
1  1  75  85  94  97
2  2  86  96  89  96
3  3  80  80  83  72
4  4  66  86  86  83

In [45]:
data_col = data[['z','y','x','w']]  ## Reverse column order
data_col

    z   y   x  w
0  84  78  68  0
1  94  85  75  1
2  89  96  86  2
3  83  80  80  3
4  86  86  66  4

In [46]:
data_row = data.reindex([4,3,2,1,0]) ### Reverse row order
data_row

   w   x   y   z
4  4  66  86  86  83
3  3  80  80  83  72
2  2  86  96  89  96
1  1  75  85  94  97
0  0  68  78  84  86

In [47]:
data_reindex = data.reindex([0,1,2,3,4]) ## Reverse row order and reset index
data_reindex

   w   x   y   z
0  0  68  78  84  86
1  1  75  85  94  97
2  2  86  96  89  96
3  3  80  80  83  72
4  4  66  86  86  83

#2. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [31]:
### Sample Python dictionary data and list labels:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [32]:
exam_data = pd.DataFrame(exam_data, index = labels )
exam_data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [33]:
exam_data.drop(['attempts'], axis = 1)  ##delete the 'attempts' column

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

#3. Write a Pandas program to rename columns of a given DataFrame

In [3]:
sample_data = pd.DataFrame({
'col1' : [1,4,3,4,5],
'col2' :[4,5,6,7,8],
'col3' : [7,8,9,0,1]})
sample_data

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [76]:
sample_data.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [77]:
sample_data.rename(columns={ 'col1': 'column1', 
                              'col2' :'column2','col3' : 'column3'})  ###  renaming columns

   column1  column2  column3
0        1        4        7
1        4        5        8
2        3        6        9
3        4        7        0
4        5        8        1



4. Write a Pandas program to select rows from a given DataFrame based on values in some columns

In [5]:
print(sample_data.loc[sample_data['col1'] == 4]) ### Rows for colum1 value == 4

   col1  col2  col3
1     4     5     8
3     4     7     0


5. Write a Pandas program to add one row in an existing DataFrame

In [7]:
new_row = {'col1': 10, 'col2': 11, 'col3': 12}
sample_data.append(new_row, ignore_index=True)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12


6. Write a Pandas program to drop a list of rows from a specified DataFrame.

In [8]:
sample_data.drop(sample_data.index[[2,4]])  ### removing 2nd & 4th rows

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

7. Write a Pandas program to find the row for where the value of a given column is maximum

In [24]:
print("Row where col1 has maximum value:")
print(sample_data['col1'].argmax())

Row where col1 has maximum value:
4

In [12]:
print("Row where col2 has maximum value:")
print(sample_data['col2'].argmax())

Row where col2 has maximum value:
4

In [13]:
print("Row where col3 has maximum value:")
print(sample_data['col3'].argmax())

Row where col3 has maximum value:
2

8. Write a Pandas program to count number of columns of a DataFrame.

In [16]:
n_columns = len(sample_data.axes[1])   ### count number of columns of a DataFrame.
print('number of columns : ' +str(n_columns))

number of columns : 3



9. Write a Pandas program to select all columns, except one given column in a DataFrame.

In [19]:
print("\nAll columns except 'col3':")                ###  select all columns, except one given column in a DataFrame.
sample_data2 = sample_data.loc[:, sample_data.columns != 'col3']
print(sample_data2)

All columns except 'col3':
   col1  col2
0     1     4
1     4     5
2     3     6
3     4     7
4     5     8

10. Write a Pandas program to get first n records of a DataFrame.

In [23]:
print("\nFirst 3 rows of the  DataFrame':")  ### to get first n records of a DataFrame.
sample_data3 = sample_data.head(3)
print(sample_data3)

First 3 rows of the  DataFrame':
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9